# LIBRERIAS

In [1]:
import pandas as pd #pip install pandas

# Caargar datos

In [2]:
df = pd.read_csv("./dataset.csv")
df.head(5)

,id,full_text,favorites,retweets,mentions,country,user,followers,followees
0,183721,Flying home to run down from the power to comi...,23.0,NaN,10.0,ECUADOR,leonardokuffo,389.0,258
1,183722,Today we commemorate and MNML Case.,500.0,21.0,NaN,BRASIL,mateusmartins,982.0,1822
2,183723,Today we have reached US$6.55 Billion TT$44â€¦,190.0,123.0,6.0,MEXICO,pedrojuarez,12.0,129
3,183724,Faking It by Joel Atwell. Written by Other cou...,131.0,76.0,3.0,ECUADOR,galocastillo,332.0,378
4,183725,Welcome back! ðŸ™Œ,113.0,130.0,9.0,MEXICO,pedrojuarez,12.0,129

In [3]:
df["favorites"]

0      23.0
1     500.0
2     190.0
3     131.0
4     113.0
5     492.0
6     158.0
7       NaN
8     198.0
9     272.0
10     43.0
11    349.0
12    467.0
13     50.0
14    418.0
15    361.0
16    346.0
17    296.0
18    315.0
19    133.0
20     92.0
21    255.0
22    432.0
23    430.0
24    424.0
25    488.0
26    318.0
Name: favorites, dtype: float64

In [4]:
df2 = pd.read_excel("F:/Desarrollo/IAG344/Personal/Mision2/Reto1/ejemplo.xlsx")
df2.head()

,Cedula,Nombre,Apellido,Cedula_Limpia,Nombre_Completo,Unnamed: 5,Unnamed: 6
0,1234567,Juan,1234567 Juan,NaN,NaN,NaN,4466644
1,987654,Maria,987654 Maria,NaN,NaN,NaN,7566

In [5]:
df.loc[3]

id                                                      183724
full_text    Faking It by Joel Atwell. Written by Other cou...
favorites                                                131.0
retweets                                                  76.0
mentions                                                   3.0
country                                                ECUADOR
user                                              galocastillo
followers                                                332.0
followees                                                  378
Name: 3, dtype: object

In [6]:
df.head()

,id,full_text,favorites,retweets,mentions,country,user,followers,followees
0,183721,Flying home to run down from the power to comi...,23.0,NaN,10.0,ECUADOR,leonardokuffo,389.0,258
1,183722,Today we commemorate and MNML Case.,500.0,21.0,NaN,BRASIL,mateusmartins,982.0,1822
2,183723,Today we have reached US$6.55 Billion TT$44â€¦,190.0,123.0,6.0,MEXICO,pedrojuarez,12.0,129
3,183724,Faking It by Joel Atwell. Written by Other cou...,131.0,76.0,3.0,ECUADOR,galocastillo,332.0,378
4,183725,Welcome back! ðŸ™Œ,113.0,130.0,9.0,MEXICO,pedrojuarez,12.0,129

In [7]:
df.loc[0:2]

,id,full_text,favorites,retweets,mentions,country,user,followers,followees
0,183721,Flying home to run down from the power to comi...,23.0,NaN,10.0,ECUADOR,leonardokuffo,389.0,258
1,183722,Today we commemorate and MNML Case.,500.0,21.0,NaN,BRASIL,mateusmartins,982.0,1822
2,183723,Today we have reached US$6.55 Billion TT$44â€¦,190.0,123.0,6.0,MEXICO,pedrojuarez,12.0,129

In [8]:
df.loc[[0,5,3]]

,id,full_text,favorites,retweets,mentions,country,user,followers,followees
0,183721,Flying home to run down from the power to comi...,23.0,NaN,10.0,ECUADOR,leonardokuffo,389.0,258
5,183726,Contest: Win a fan of his ass. #thatisall Thanks!,492.0,70.0,6.0,BRASIL,mateusmartins,982.0,1822
3,183724,Faking It by Joel Atwell. Written by Other cou...,131.0,76.0,3.0,ECUADOR,galocastillo,332.0,378